
INSERT INTO brand (name) VALUES ('麦小六'), ('倍食记');

INSERT INTO customer (name, phone, address,remake) VALUES 
('麦小六', '13512054372', '天津河东区耐火路','自己的经销商','经销商');

INSERT INTO build (id,name, build_data) VALUES
(1,'果子面包', '{ "面粉": 25000, "鸡蛋":1500, "糖": 4000, "盐": 250, "葡萄干": 2000, "苹果丁": 1000, "橙皮丁": 1000, "白兰地": 100, "脱氢乙酸钠": 10, "丙酸钙": 60, "面包改良剂": 250, "酵母": 600, "复配面包乳化剂": 1000, "无水酥油": 3000, "水":10500}');
INSERT INTO build (id,name, build_data) VALUES
(2, '无蔗糖切片','{ "面粉": 25000, "鸡蛋":1500, "麦麸": 750, "烘焙奶粉": 1250, "糖": 4000, "盐": 250, "脱氢乙酸钠": 10, "丙酸钙": 75, "面包改良剂": 250, "酵母": 500, "复配面包乳化剂": 1000, "无水酥油": 3000, "水":11000}');
INSERT INTO build (id,name, build_data) VALUES
(3,'俄罗斯大列巴', '{"鸡蛋":1500, "面粉": 25000, "麦麸": 750, "无蔗糖粉": 4000, "盐": 250, "脱氢乙酸钠": 10, "丙酸钙": 75, "面包改良剂": 250, "酵母": 600, "复配面包乳化剂": 1000, "无水酥油": 3000, "水":11000, "总计": 49920}');

INSERT INTO product (barcode,brand_id,name,specification,materialUnit, price,build_id) VALUES
('6977281690029',1,'果子面包', 115,123, 1.5, 1),
('6977281690036',1,'无蔗糖切片', 500,144, 6, 1),
('6977281690005',1,'俄罗斯大列巴', 300,320, 4.5, 1),
('6977281690074',1,'俄罗斯大列巴（通用包装）', 300,320, 4.5, 1),
('6977281690081',2,'俄罗斯大列巴', 300,320, 4.5, 1),
('6977281690050',1,'俄罗斯大列巴（小）', 90,106, 1.5, 1);


INSERT INTO material(name,brand,info,unit,price)VALUES
("麦麸", "暂无", "星耀", 40, 120),
("面粉-冀南香5号粉", "冀南香5号粉", "三合", 25, 96),
("面粉-冀南香8号粉", "冀南香8号粉", "三合", 25, 110),
("无蔗糖粉", "绿创元", "拼多多", 2, 24),
("糖", "暂无", "三合", 50, 340),
("盐", "暂无", "星耀", 20, 16),
("低筋粉", "冀南香", "三合", 25, 115),
("可可粉", "暂无", "拼多多", 2.5, 32.52),
("核桃仁", "暂无", "星耀", 15, 390),
("葡萄干", "暂无", "星耀", 10, 95),
("苹果丁", "暂无", "星耀", 20, 310),
("橙皮丁", "暂无", "星耀", 10, 140),
("白兰地", "暂无", "星耀", 750, 12.5),
("脱氢乙酸钠", "奥凯", "星耀", 1, 32),
("丙酸钙", "奥凯", "星耀", 1, 15),
("面包改良剂", "安琪", "星耀", 1, 16),
("高糖酵母", "安琪", "三合", 5, 95),
("复配面包乳化剂", "白钻", "星耀", 20, 180),
("无水酥油", "暂无", "三合", 10, 90),
("鸡蛋", "暂无", "静海养鸡场", 0.5, 4.5),
("老面", "用5号粉", "自制", 1.5, 5);