
INSERT INTO brand (name) VALUES ('麦小六'), ('倍食记');

INSERT INTO customer (name, phone, address,remake) VALUES 
('麦小六', '13512054372', '天津河东区耐火路','自己的经销商','经销商');

INSERT INTO build (id,name,remake,materialUnit,bakingtime,bakingtem,water, build_data) VALUES
(1,'俄罗斯大列巴','300g大列巴',320,32,160,9500,'{"鸡蛋":1500, "面粉": 25000, "麦麸": 750, "无蔗糖粉": 4000, "盐": 250, "脱氢乙酸钠": 10, "丙酸钙": 75, "面包改良剂": 250, "酵母": 600, "复配面包乳化剂": 1000, "无水酥油": 3000, "总计": 49920}');

INSERT INTO goods (barcode,name,brand,remake,unit,price,build_id,ptype) VALUES
('6977281690029','果子面包','麦小六','麦小六', 115, 1.5, 1,'成品'),
('6977281690036','无蔗糖切片', '麦小六','麦小六',500, 6, 1,'成品'),
('6977281690005','俄罗斯大列巴','麦小六','麦小六', 300, 4.5, 1,'成品'),
('6977281690074','俄罗斯大列巴（通用包装）', '麦小六','麦小六',300, 4.5, 1,'成品'),
('6977281690081','俄罗斯大列巴', '麦小六','麦小六',300, 4.5, 1,'成品'),
('6977281690050','俄罗斯大列巴（小）','麦小六','麦小六', 90, 1.5, 1,'成品'),
('1',"麦麸", "暂无", "星耀", 40000, 120,-1,'原料'),
('2',"面粉-冀南香5号粉", "冀南香5号粉", "三合", 25000, 96,-1,'原料'),
('3',"面粉-冀南香8号粉", "冀南香8号粉", "三合", 25000, 110,-1,'原料'),
('4',"无蔗糖粉", "绿创元", "拼多多", 2, 24,-1,'原料'),
('5',"糖", "暂无", "三合", 50000, 340,-1,'原料'),
('6',"盐", "暂无", "星耀", 20000, 16,-1,'原料'),
('7',"低筋粉", "冀南香", "三合", 25000, 115,-1,'原料'),
('8',"可可粉", "暂无", "拼多多", 2500, 32.52,-1,'原料'),
('9',"核桃仁", "暂无", "星耀", 1500, 390,-1,'原料'),
('10',"葡萄干", "暂无", "星耀", 1000, 95,-1,'原料'),
('11',"苹果丁", "暂无", "星耀", 2000, 310,-1,'原料'),
('12',"橙皮丁", "暂无", "星耀", 1000, 140,-1,'原料'),
('13',"白兰地", "暂无", "星耀", 75000, 12.5,-1,'原料'),
('14',"脱氢乙酸钠", "奥凯", "星耀", 1000, 32,-1,'原料'),
('15',"丙酸钙", "奥凯", "星耀", 1000, 15,-1,'原料'),
('16',"面包改良剂", "安琪", "星耀", 1000, 16,-1,'原料'),
('17',"高糖酵母", "安琪", "三合", 5000, 95,-1,'原料'),
('18',"复配面包乳化剂", "白钻", "星耀", 20000, 180,-1,'原料'),
('19',"无水酥油", "暂无", "三合", 10000, 90,-1,'原料'),
('20',"鸡蛋", "暂无", "静海养鸡场", 500, 4.5,-1,'原料'),
('21',"老面", "用5号粉", "自制", 1500, 5,-1,'原料');